## Terraform Validation Results 🔍

#### Format Check 🎨 `success`
#### Validation ✔️ `success`
#### Plan 📖 `success`
#### Changes Detected: ✅ Yes

<details><summary>Show Plan Output</summary>

```terraform
random_pet.bucket_id: Refreshing state... [id=frank-serval]
data.google_client_config.default: Reading...
module.cluster.google_kms_key_ring.gke_keyring[0]: Refreshing state... [id=projects/ordinal-verbena-471611-k0/locations/europe-west1/keyRings/k8s-platform-prod-cluster-keyring]
module.network.google_compute_network.vpc: Refreshing state... [id=projects/ordinal-verbena-471611-k0/global/networks/k8s-platform-vpc]
module.cluster.data.google_project.project: Reading...
google_storage_bucket.bucket_for_state: Refreshing state... [id=terraform-bucket-frank-serval]
data.google_client_config.default: Read complete after 0s [id=projects/ordinal-verbena-471611-k0/regions/europe-west1/zones/]
module.network.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/ordinal-verbena-471611-k0/global/addresses/k8s-platform-vpc-private-ip]
module.network.google_compute_router.router: Refreshing state... [id=projects/ordinal-verbena-471611-k0/regions/europe-west1/routers/k8s-platform-vpc-router]
module.network.google_compute_firewall.allow_health_checks: Refreshing state... [id=projects/ordinal-verbena-471611-k0/global/firewalls/k8s-platform-vpc-allow-health-checks]
module.network.google_compute_subnetwork.subnets["database"]: Refreshing state... [id=projects/ordinal-verbena-471611-k0/regions/europe-west1/subnetworks/database]
module.network.google_compute_subnetwork.subnets["kubernetes"]: Refreshing state... [id=projects/ordinal-verbena-471611-k0/regions/europe-west1/subnetworks/kubernetes]
module.cluster.data.google_project.project: Read complete after 0s [id=projects/ordinal-verbena-471611-k0]
module.network.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fordinal-verbena-471611-k0%2Fglobal%2Fnetworks%2Fk8s-platform-vpc:servicenetworking.googleapis.com]
module.network.google_compute_router_nat.nat: Refreshing state... [id=ordinal-verbena-471611-k0/europe-west1/k8s-platform-vpc-router/k8s-platform-vpc-nat]
module.network.google_compute_firewall.allow_internal: Refreshing state... [id=projects/ordinal-verbena-471611-k0/global/firewalls/k8s-platform-vpc-allow-internal]
module.cluster.google_kms_crypto_key.gke_etcd_key[0]: Refreshing state... [id=projects/ordinal-verbena-471611-k0/locations/europe-west1/keyRings/k8s-platform-prod-cluster-keyring/cryptoKeys/k8s-platform-prod-cluster-etcd-key]
module.cluster.google_kms_crypto_key_iam_member.gke_etcd_key_binding[0]: Refreshing state... [id=projects/ordinal-verbena-471611-k0/locations/europe-west1/keyRings/k8s-platform-prod-cluster-keyring/cryptoKeys/k8s-platform-prod-cluster-etcd-key/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceAccount:service-4204403698@container-engine-robot.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = true
      + disable_l4_lb_firewall_reconciliation    = false
      + effective_labels                         = {
          + "goog-terraform-provisioned" = "true"
        }
      + enable_cilium_clusterwide_network_policy = false
      + enable_fqdn_network_policy               = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "europe-west1"
      + logging_service                          = "logging.googleapis.com/kubernetes"
      + master_version                           = (known after apply)
      + monitoring_service                       = "monitoring.googleapis.com/kubernetes"
      + name                                     = "k8s-platform-prod-cluster"
      + network                                  = "k8s-platform-vpc"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "ordinal-verbena-471611-k0"
      + remove_default_node_pool                 = true
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "kubernetes"
      + terraform_labels                         = {
          + "goog-terraform-provisioned" = "true"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config {
          + cloudrun_config (known after apply)
          + config_connector_config (known after apply)
          + dns_cache_config (known after apply)
          + gce_persistent_disk_csi_driver_config (known after apply)
          + gcp_filestore_csi_driver_config (known after apply)
          + gcs_fuse_csi_driver_config (known after apply)
          + gke_backup_agent_config (known after apply)
          + horizontal_pod_autoscaling (known after apply)
          + http_load_balancing {
              + disabled = false
            }
          + network_policy_config {
              + disabled = false
            }
          + parallelstore_csi_driver_config (known after apply)
          + ray_operator_config (known after apply)
          + stateful_ha_config (known after apply)
        }

      + authenticator_groups_config (known after apply)

      + binary_authorization {
          + evaluation_mode = "PROJECT_SINGLETON_POLICY_ENFORCE"
        }

      + cluster_autoscaling (known after apply)

      + confidential_nodes (known after apply)

      + control_plane_endpoints_config (known after apply)

      + cost_management_config (known after apply)

      + database_encryption {
          + key_name = "projects/ordinal-verbena-471611-k0/locations/europe-west1/keyRings/k8s-platform-prod-cluster-keyring/cryptoKeys/k8s-platform-prod-cluster-etcd-key"
          + state    = "ENCRYPTED"
        }

      + default_snat_status (known after apply)

      + enterprise_config (known after apply)

      + gateway_api_config (known after apply)

      + identity_service_config (known after apply)

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services"
          + stack_type                    = "IPV4"

          + pod_cidr_overprovision_config (known after apply)
        }

      + logging_config (known after apply)

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "02:00"
            }
        }

      + master_auth (known after apply)

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled      = (known after apply)
          + private_endpoint_enforcement_enabled = (known after apply)
        }

      + mesh_certificates (known after apply)

      + monitoring_config (known after apply)

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config (known after apply)

      + node_pool (known after apply)

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config (known after apply)

      + private_cluster_config {
          + enable_private_endpoint = true
          + enable_private_nodes    = true
          + master_ipv4_cidr_block  = "172.16.0.0/28"
          + peering_name            = (known after apply)
          + private_endpoint        = (known after apply)
          + public_endpoint         = (known after apply)

          + master_global_access_config (known after apply)
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + secret_manager_config {
          + enabled = false
        }

      + security_posture_config (known after apply)

      + service_external_ips_config (known after apply)

      + vertical_pod_autoscaling (known after apply)

      + workload_identity_config {
          + workload_pool = "ordinal-verbena-471611-k0.svc.id.goog"
        }
    }

  # module.cluster.google_container_node_pool.pools["default-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "k8s-platform-prod-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "default-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "ordinal-verbena-471611-k0"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 2
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config (known after apply)

      + node_config {
          + disk_size_gb     = 20
          + disk_type        = "pd-standard"
          + effective_taints = (known after apply)
          + image_type       = (known after apply)
          + labels           = {
              + "environment"   = "production"
              + "workload-type" = "critical"
            }
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-standard-2"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = (known after apply)
          + spot             = false

          + confidential_nodes (known after apply)

          + gcfs_config (known after apply)

          + guest_accelerator (known after apply)

          + kubelet_config (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + windows_node_config (known after apply)

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"

          + blue_green_settings (known after apply)
        }
    }

  # module.cluster.google_container_node_pool.pools["spot-instance-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "k8s-platform-prod-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "spot-instance-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "ordinal-verbena-471611-k0"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 1
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config (known after apply)

      + node_config {
          + disk_size_gb     = 10
          + disk_type        = "pd-standard"
          + effective_taints = (known after apply)
          + image_type       = (known after apply)
          + labels           = {
              + "cloud.google.com/gke-spot" = "true"
              + "environment"               = "production"
              + "workload-type"             = "resilient"
            }
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-standard-2"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = (known after apply)
          + spot             = true

          + confidential_nodes (known after apply)

          + gcfs_config (known after apply)

          + guest_accelerator (known after apply)

          + kubelet_config (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }

          + taint {
              + effect = "NO_SCHEDULE"
              + key    = "cloud.google.com/gke-spot"
              + value  = "true"
            }

          + windows_node_config (known after apply)

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"

          + blue_green_settings (known after apply)
        }
    }

  # module.database.google_secret_manager_secret.postgres_password will be created
  + resource "google_secret_manager_secret" "postgres_password" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "ordinal-verbena-471611-k0"
      + secret_id             = "k8s-platform-postgresdb-postgres-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "europe-west1"
                }
            }
        }
    }

  # module.database.google_secret_manager_secret.user_passwords["cart-user"] will be created
  + resource "google_secret_manager_secret" "user_passwords" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "ordinal-verbena-471611-k0"
      + secret_id             = "k8s-platform-postgresdb-cart-user-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "europe-west1"
                }
            }
        }
    }

  # module.database.google_secret_manager_secret.user_passwords["order-user"] will be created
  + resource "google_secret_manager_secret" "user_passwords" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "ordinal-verbena-471611-k0"
      + secret_id             = "k8s-platform-postgresdb-order-user-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "europe-west1"
                }
            }
        }
    }

  # module.database.google_secret_manager_secret.user_passwords["product-user"] will be created
  + resource "google_secret_manager_secret" "user_passwords" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "ordinal-verbena-471611-k0"
      + secret_id             = "k8s-platform-postgresdb-product-user-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "europe-west1"
                }
            }
        }
    }

  # module.database.google_secret_manager_secret.user_passwords["review-user"] will be created
  + resource "google_secret_manager_secret" "user_passwords" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "ordinal-verbena-471611-k0"
      + secret_id             = "k8s-platform-postgresdb-review-user-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "europe-west1"
                }
            }
        }
    }

  # module.database.google_secret_manager_secret_version.postgres_password will be created
  + resource "google_secret_manager_secret_version" "postgres_password" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.database.google_secret_manager_secret_version.user_passwords["cart-user"] will be created
  + resource "google_secret_manager_secret_version" "user_passwords" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.database.google_secret_manager_secret_version.user_passwords["order-user"] will be created
  + resource "google_secret_manager_secret_version" "user_passwords" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.database.google_secret_manager_secret_version.user_passwords["product-user"] will be created
  + resource "google_secret_manager_secret_version" "user_passwords" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.database.google_secret_manager_secret_version.user_passwords["review-user"] will be created
  + resource "google_secret_manager_secret_version" "user_passwords" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = (known after apply)
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.database.google_sql_database.databases["cart-service"] will be created
  + resource "google_sql_database" "databases" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "k8s-platform-postgresdb"
      + name            = "cart-service"
      + project         = "ordinal-verbena-471611-k0"
      + self_link       = (known after apply)
    }

  # module.database.google_sql_database.databases["order-service"] will be created
  + resource "google_sql_database" "databases" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "k8s-platform-postgresdb"
      + name            = "order-service"
      + project         = "ordinal-verbena-471611-k0"
      + self_link       = (known after apply)
    }

  # module.database.google_sql_database.databases["product-service"] will be created
  + resource "google_sql_database" "databases" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "k8s-platform-postgresdb"
      + name            = "product-service"
      + project         = "ordinal-verbena-471611-k0"
      + self_link       = (known after apply)
    }

  # module.database.google_sql_database.databases["review-service"] will be created
  + resource "google_sql_database" "databases" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "k8s-platform-postgresdb"
      + name            = "review-service"
      + project         = "ordinal-verbena-471611-k0"
      + self_link       = (known after apply)
    }

  # module.database.google_sql_database_instance.postgres will be created
  + resource "google_sql_database_instance" "postgres" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_17"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "k8s-platform-postgresdb"
      + private_ip_address             = (known after apply)
      + project                        = "ordinal-verbena-471611-k0"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west1"
      + replica_names                  = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + replication_cluster (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "REGIONAL"
          + connector_enforcement       = (known after apply)
          + deletion_protection_enabled = false
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 20
          + disk_type                   = "PD_SSD"
          + edition                     = "ENTERPRISE"
          + pricing_plan                = "PER_USE"
          + tier                        = "db-custom-2-4096"
          + user_labels                 = {
              + "environment" = "production"
            }
          + version                     = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + location                       = "europe-west3"
              + point_in_time_recovery_enabled = true
              + start_time                     = "02:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + connection_pool_config (known after apply)

          + data_cache_config (known after apply)

          + database_flags {
              + name  = "log_checkpoints"
              + value = "on"
            }
          + database_flags {
              + name  = "log_connections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_disconnections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_lock_waits"
              + value = "on"
            }
          + database_flags {
              + name  = "log_min_error_statement"
              + value = "error"
            }
          + database_flags {
              + name  = "log_min_messages"
              + value = "warning"
            }
          + database_flags {
              + name  = "log_statement"
              + value = "ddl"
            }
          + database_flags {
              + name  = "log_temp_files"
              + value = "0"
            }
          + database_flags {
              + name  = "pg_stat_statements.max"
              + value = "10000"
            }
          + database_flags {
              + name  = "pg_stat_statements.track"
              + value = "all"
            }

          + insights_config {
              + query_insights_enabled  = true
              + query_plans_per_minute  = (known after apply)
              + query_string_length     = 1024
              + record_application_tags = true
              + record_client_address   = true
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/ordinal-verbena-471611-k0/global/networks/k8s-platform-vpc"
              + server_ca_mode  = (known after apply)
              + ssl_mode        = (known after apply)
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 3
              + update_track = "stable"
            }
        }
    }

  # module.database.google_sql_user.postgres will be created
  + resource "google_sql_user" "postgres" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "k8s-platform-postgresdb"
      + name                    = "postgres"
      + password                = (sensitive value)
      + project                 = "ordinal-verbena-471611-k0"
      + sql_server_user_details = (known after apply)
    }

  # module.database.google_sql_user.users["cart-user"] will be created
  + resource "google_sql_user" "users" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "k8s-platform-postgresdb"
      + name                    = "cart-user"
      + password                = (sensitive value)
      + project                 = "ordinal-verbena-471611-k0"
      + sql_server_user_details = (known after apply)
    }

  # module.database.google_sql_user.users["order-user"] will be created
  + resource "google_sql_user" "users" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "k8s-platform-postgresdb"
      + name                    = "order-user"
      + password                = (sensitive value)
      + project                 = "ordinal-verbena-471611-k0"
      + sql_server_user_details = (known after apply)
    }

  # module.database.google_sql_user.users["product-user"] will be created
  + resource "google_sql_user" "users" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "k8s-platform-postgresdb"
      + name                    = "product-user"
      + password                = (sensitive value)
      + project                 = "ordinal-verbena-471611-k0"
      + sql_server_user_details = (known after apply)
    }

  # module.database.google_sql_user.users["review-user"] will be created
  + resource "google_sql_user" "users" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "k8s-platform-postgresdb"
      + name                    = "review-user"
      + password                = (sensitive value)
      + project                 = "ordinal-verbena-471611-k0"
      + sql_server_user_details = (known after apply)
    }

  # module.database.random_password.postgres_password will be created
  + resource "random_password" "postgres_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.database.random_password.user_passwords["cart-user"] will be created
  + resource "random_password" "user_passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "-_+.,"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.database.random_password.user_passwords["order-user"] will be created
  + resource "random_password" "user_passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "-_+.,"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.database.random_password.user_passwords["product-user"] will be created
  + resource "random_password" "user_passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "-_+.,"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.database.random_password.user_passwords["review-user"] will be created
  + resource "random_password" "user_passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "-_+.,"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.dns.google_dns_managed_zone.private_zone will be created
  + resource "google_dns_managed_zone" "private_zone" {
      + creation_time    = (known after apply)
      + description      = "Private DNS zone for internal services"
      + dns_name         = "platform.internal."
      + effective_labels = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "team"                       = "platform"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "environment" = "production"
          + "managed_by"  = "terraform"
          + "team"        = "platform"
        }
      + managed_zone_id  = (known after apply)
      + name             = "platform-internal"
      + name_servers     = (known after apply)
      + project          = "ordinal-verbena-471611-k0"
      + terraform_labels = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "team"                       = "platform"
        }
      + visibility       = "private"

      + cloud_logging_config (known after apply)

      + dnssec_config (known after apply)

      + private_visibility_config {
          + networks {
              + network_url = "projects/ordinal-verbena-471611-k0/global/networks/k8s-platform-vpc"
            }
        }
    }

  # module.dns.google_dns_record_set.database will be created
  + resource "google_dns_record_set" "database" {
      + id           = (known after apply)
      + managed_zone = "platform-internal"
      + name         = "postgresql.platform.internal."
      + project      = "ordinal-verbena-471611-k0"
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 30 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubernetes_cluster   = (sensitive value)
  ~ postgres_instance    = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @rotimiAbiola, Action: `pull_request`, Working Directory: `/home/runner/work/terraform-gke-platform/terraform-gke-platform`*